Repository: firadmuhammed827-ux/firas-ios
Catalog: ios/FirasAI/Features/Code/Code.xcstrings
Source language: en
Languages: ar

# code.account
source: Account
ar: الحساب

# code.attach
source: Attach image or file
ar: إرفاق صورة أو ملف

# code.blank
source: Blank project
ar: مشروع فارغ

# code.build
source: Build with AI
ar: ابنِ بالذكاء الاصطناعي

# code.buildCloud
source: You can leave; the build will continue in the cloud.
ar: يمكنك المغادرة؛ سيستمر البناء في السحابة.

# code.building
source: Planning, writing, and wiring files
ar: يخطط للملفات ويكتبها ويربطها

# code.cancel
source: Cancel
ar: إلغاء

# code.delete
source: Delete project
ar: حذف المشروع

# code.dismissError
source: Dismiss error
ar: إخفاء الخطأ

# code.editor
source: Editor
ar: المحرر

# code.files
source: Files
ar: الملفات

# code.hero
source: Turn an idea into a working project
ar: حوّل فكرتك إلى مشروع يعمل

# code.hero.detail
source: Describe what you want and Firas will plan and build the files. Edit code and preview it directly on iPhone or iPad.
ar: صِف ما تريد، وسيخطط فِراس للملفات ويبنيها. عدّل الكود وشاهد النتيجة مباشرة على iPhone أو iPad.

# code.library
source: Project library
ar: مكتبة المشاريع

# code.noPreview
source: No HTML page to preview
ar: لا توجد صفحة HTML للمعاينة

# code.openSidebar
source: Open sidebar
ar: فتح القائمة

# code.preview
source: Preview
ar: المعاينة

# code.projectName
source: Project name
ar: اسم المشروع

# code.projectName.placeholder
source: Project name (optional)
ar: اسم المشروع (اختياري)

# code.prompt
source: Project brief
ar: وصف المشروع

# code.prompt.placeholder
source: Describe the site, app, or game in detail…
ar: صِف الموقع أو التطبيق أو اللعبة بالتفصيل…

# code.readingAttachments
source: Reading attachments on device…
ar: يقرأ المرفقات على الجهاز…

# code.recent
source: Recent projects
ar: المشاريع الأخيرة

# code.removeAttachment
source: Remove attachment
ar: إزالة المرفق

# code.signIn
source: Sign in to build
ar: سجّل الدخول للبناء

# code.title
source: Firas Code
ar: فِراس Code
